#╒═════════════════════════════════════════════════════════════════════════╛
# ■ Game_Event.coffee
#╒═════════════════════════════════════════════════════════════════════════╛
#---------------------------------------------------------------------------
do ->

    #@[DEFINES]
    _ = Game_Event::

    _.dataOserverHaveChanges = ->
        if ANGameManager.isMapMaster()
            ANGameManager.sendEventObserver(@eventId())
        # * Если мы не отправляем данные Observer,
        # то check не будет работать, пока не сбросить флаг
        return
    
    return
# ■ END Game_Event.coffee
#---------------------------------------------------------------------------