#╒═════════════════════════════════════════════════════════════════════════╛
# ■ Scene_Boot.coffee
#╒═════════════════════════════════════════════════════════════════════════╛
#---------------------------------------------------------------------------
do ->

    #@[DEFINES]
    _ = Scene_Boot::

    # * Загружаем и инициализируем сетевой код
    #@[ALIAS]
    ALIAS__initialize = _.initialize
    _.initialize = ->
        ALIAS__initialize.call(@)
        

    return
# ■ END Scene_Boot.coffee
#---------------------------------------------------------------------------