# * Глабольный менеджер с основными методами системы

ANET.System = ->

#╒═════════════════════════════════════════════════════════════════════════╛
# ■ IMPLEMENTATION.coffee
#╒═════════════════════════════════════════════════════════════════════════╛
#---------------------------------------------------------------------------
do ->

    #@[DEFINES]
    _ = ANET.System

    # * Начальная загрузка компонентов
    # -----------------------------------------------------------------------
    do ->

        #TODO: * Лог свой для сообщений версий
        _.initSystem = ->
            "INIT ANET SYSTEM".p()
            @loadParameters()
            HUIManager.init()
            return

        _.loadParameters = ->
            ANET.PP = new ANET.ParamsManager()

        
        return
    # -----------------------------------------------------------------------

# ■ END IMPLEMENTATION.coffee
#---------------------------------------------------------------------------