#╒═════════════════════════════════════════════════════════════════════════╛
# ■ MV PATCH.coffee
#╒═════════════════════════════════════════════════════════════════════════╛
#---------------------------------------------------------------------------
do ->

    #TODO: Может вынести в ACore ?

    return unless KDCore.isMV()


    #╒═════════════════════════════════════════════════════════════════════════╛
    # ■ Scene_Base.coffee
    #╒═════════════════════════════════════════════════════════════════════════╛
    #---------------------------------------------------------------------------
    do ->
    
        #@[DEFINES]
        _ = Scene_Base::
    
        # * Данного метода нет в MV
        _.calcWindowHeight = (numLines, selectable) ->
            if selectable is true
                return Window_Selectable::fittingHeight(numLines)
            else
                return Window_Base::fittingHeight(numLines)
        
        return
    # ■ END Scene_Base.coffee
    #---------------------------------------------------------------------------
    
    #╒═════════════════════════════════════════════════════════════════════════╛
    # ■ Window_Selectable.coffee
    #╒═════════════════════════════════════════════════════════════════════════╛
    #---------------------------------------------------------------------------
    do ->
    
        #@[DEFINES]
        _ = Window_Selectable::
    
        # * Данного метода нет в MV
        _.itemLineRect = (index) -> @itemRect(index)
        
        return
    # ■ END Window_Selectable.coffee
    #---------------------------------------------------------------------------

    #╒═════════════════════════════════════════════════════════════════════════╛
    # ■ Game_Followers.coffee
    #╒═════════════════════════════════════════════════════════════════════════╛
    #---------------------------------------------------------------------------
    do ->
    
        #@[DEFINES]
        _ = Game_Followers::
    
        # * В MZ этот метод разделён на setup
        #@[ALIAS]
        ALIAS__initialize = _.initialize
        _.initialize = ->
            ALIAS__initialize.call(@)
            if ANNetwork.isConnected()
                @_data = [] # * Нет follower'ов
            
        
        return
    # ■ END Game_Followers.coffee
    #---------------------------------------------------------------------------

    #╒═════════════════════════════════════════════════════════════════════════╛
    # ■ Graphics.coffee
    #╒═════════════════════════════════════════════════════════════════════════╛
    #---------------------------------------------------------------------------
    do ->
    
        #@[DEFINES]
        _ = Graphics
    

        #TODO: Пока это не повлияло положительно!

        #$[OVER]
        # * В MV отключено выделение HTML элементов по умолчанию
        _._disableTextSelection = -> # * EMPTY
        
        return
    # ■ END Graphics.coffee
    #---------------------------------------------------------------------------

    return
# ■ END MV PATCH.coffee
#---------------------------------------------------------------------------


