# * Глабольный набор вспомогательных функций для пользователя

nAPI = ->

#╒═════════════════════════════════════════════════════════════════════════╛
# ■ IMPLEMENTATION.coffee
#╒═════════════════════════════════════════════════════════════════════════╛
#---------------------------------------------------------------------------
do ->
    #@[DEFINES]
    _ = nAPI

    _.isNetworkGame = ->
        try
            return ANNetwork.isConnected()
        catch e
            KDCore.warning e
        return false

    

    return
# ■ END IMPLEMENTATION.coffee
#---------------------------------------------------------------------------