#╒═════════════════════════════════════════════════════════════════════════╛
# ■ Game_Followers.coffee
#╒═════════════════════════════════════════════════════════════════════════╛
#---------------------------------------------------------------------------
do ->

    #@[DEFINES]
    _ = Game_Followers::

    #@[ALIAS]
    ALIAS__setup = _.setup
    _.setup = ->
        if ANNetwork.isConnected()
            @_data = []
            # * Нет последователей! Используется другой класс
        else
            ALIAS__setup.call(@)
    
    #TODO: Тут остановился, надо создать класс NetCharacter, чтобы было видно игроков на карте

    return
# ■ END Game_Followers.coffee
#---------------------------------------------------------------------------