#╒═════════════════════════════════════════════════════════════════════════╛
# ■ NetMessages.coffee
#╒═════════════════════════════════════════════════════════════════════════╛
#---------------------------------------------------------------------------
do ->

    #@[DEFINES]
    _M = NetMessage
    _CM = (name, flag, data, socket) ->
        _M.EmptyMessageWithFlag(flag, data, socket).setName(name)

    # * Обозначения
    # f - имя комманды (флага)
    # d - данные
    # s - сокет (либо ничего)

    #?LOBBY COMMANDS
    _M.Lobby = (f, d, s) -> _CM 'lobby', f, d, s

    return
# ■ END NetMessages.coffee
#---------------------------------------------------------------------------