#╒═════════════════════════════════════════════════════════════════════════╛
# ■ Sprite_Actor.coffee
#╒═════════════════════════════════════════════════════════════════════════╛
#---------------------------------------------------------------------------
do ->

    #@[DEFINES]
    _ = Sprite_Actor::

    #TEMP
    #TODO: Временное врешение, работает только на мастере
    #@[ALIAS]
    ALIAS__retreat = _.retreat
    _.retreat = ->
        if Network.isConnected()
            if $gameParty.leader() == @_battler
                @startMove(300, 0, 30)
            else
                # * Другой персонаж не убегает
        else
            ALIAS__retreat.call(@)
    
    return
# ■ END Sprite_Actor.coffee
#---------------------------------------------------------------------------