#╒═════════════════════════════════════════════════════════════════════════╛
# ■ Sprite_Gauge.coffee
#╒═════════════════════════════════════════════════════════════════════════╛
#---------------------------------------------------------------------------
do ->

    #@[DEFINES]
    _ = Sprite_Gauge::

    #@[ALIAS]
    ALIAS__smoothness = _.smoothness
    _.smoothness = ->
        # * Делаем более плавное заполнение для сетевой битвы, чтобы не было видно "рывков"
        # * Рывки есть так как с сервера данные обновляются примерно раз в секунду в бою
        if ANNetwork.isConnected()
            return 60 if @_statusType is "time" and $gameParty.inBattle()
        return ALIAS__smoothness.call(@)
        
    
    return
# ■ END Sprite_Gauge.coffee
#---------------------------------------------------------------------------