#╒═════════════════════════════════════════════════════════════════════════╛
# ■ Scene_Title.coffee
#╒═════════════════════════════════════════════════════════════════════════╛
#---------------------------------------------------------------------------
do ->

    #@[DEFINES]
    _ = Scene_Title::

    #?EVENT
    # * Когда соединение прервано, вызывается это событие
    _.onLostConnection = -> # * NOTHING

    _.commandNetwork = ->
        @_commandWindow.close()
        SceneManager.push(Scene_NetworkGameMenu)
    
    return
# ■ END Scene_Title.coffee
#---------------------------------------------------------------------------