#╒═════════════════════════════════════════════════════════════════════════╛
# ■ Game_Switches.coffee
#╒═════════════════════════════════════════════════════════════════════════╛
#---------------------------------------------------------------------------
do ->

    #@[DEFINES]
    _ = Game_Switches::

    #TODO: Список глобальных переменных указывается в параметрах плагина
    _.isGlobalSwitch = (switchId) ->
        [1, 2, 3, 4, 5, 6, 7, 8].contains(switchId)

    _.onSwitchFromServer = (switchId, value) ->
        @_data[switchId] = value
        @onChange()
    
    return
# ■ END Game_Switches.coffee
#---------------------------------------------------------------------------